#include <boost/lexical_cast.hpp>
#include <boost/assert.hpp>
#include ".\adultrespparam.h"

namespace jysoft { namespace simulator { namespace resp {

	CAdultRespParam::CAdultRespParam(void)
	{
	}

	CAdultRespParam::~CAdultRespParam(void)
	{
	}

	//加载某呼吸速率的参数值
	void CAdultRespParam::LoadRespParams(int nIndex)
	{
		if( nIndex > 45 )
		{
            BOOST_ASSERT(0);
			nIndex = 45;
		}
		//各数值的含义：常留气量(单位:ml)；最大气量(单位:ml)；吸气时间(单位:0.1ms)；总周期时间(单位:0.1ms)；CO2(吸气)；CO2(呼气)
		static std::string strParams[][7] = {
            {"1500","1500","15000","60000","2000","0","0"},//0
            {"2500","3300","42000","600000","8000","80000","1"},//1
            {"2200","3200","45000","300000","7000","54000","2"},//2
            {"2400","3800","44000","200000","10000","32000","3"},//3
            {"2500","4000","45000","150000","13000","20000","4"},//4
            {"2500","4000","39600","120000","7000","15000","5"},//5
            {"2500","3700","33000","100000","8000","15000","6"},//6
            {"2700","3700","28200","85800","7000","12000","7"},//7
            {"2500","3500","24800","75000","6000","10000","8"},//8
            {"2700","3700","22000","66800","5000","9000","9"},//9
            {"2600","3500","19800","60000","4000","9000","10"},//10
            {"2700","3400","18000","54400","4000","9000","11"},//11
            {"2600","3200","16500","50000","4000","5000","12"},//12
            {"2700","3400","15000","46000","3000","6000","13"},//13
            {"2600","3400","14000","42800","4000","6000","14"},//14
            {"2700","3300","13200","40000","3000","7000","15"},//15
            {"2700","3300","12400","37400","2000","4000","16"},//16
            {"2700","3200","11600","35200","3000","6000","17"},//17
            {"2700","3200","11000","33200","3000","5000","18"},//18
            {"2700","3200","10400","31600","3000","5000","19"},//19
            {"2800","3100","9900","30000","3000","5000","20"},//20
            {"2800","3100","9400","28600","3000","4000","21"},//21
            {"2700","3100","9000","27200","3000","6000","22"},//22
            {"2800","3100","8600","26000","2000","4000","23"},//23
            {"2800","3100","8200","25000","3000","5000","24"},//24
            {"2800","3100","7800","24000","3000","5000","25"},//25
            {"2800","3100","7600","23000","3000","4000","26"},//26
            {"2700","3100","7200","22200","3000","4000","27"},//27
            {"2800","3100","7000","21400","3000","4000","28"},//28
            {"2800","3100","6800","20600","3000","4000","29"},//29
            {"2800","3100","6600","20000","2000","3000","30"},//30
            {"2800","3100","6400","19400","3000","3000","31"},//31
            {"2800","3200","6200","18800","3000","3000","32"},//32
            {"2800","3100","6000","18200","2000","2000","33"},//33
            {"2800","3100","5800","17600","2000","3000","34"},//34
            {"2800","3100","5600","17200","2000","3000","35"},//35
            {"2800","3000","4200","16600","2000","3000","36"},//36
            {"2800","3000","4000","16200","2000","3000","37"},//37
            {"2800","3000","3800","15800","2000","3000","38"},//38
            {"2800","3000","3600","15400","2000","2000","39"},//39
            {"2800","3000","2200","15000","2000","3000","40"},//40
            {"2800","3000","2000","14600","1000","3000","41"},//41
            {"2800","3000","1800","14200","1000","3000","42"},//42
            {"2900","3000","1600","14000","1000","2000","43"},//43
            {"2900","3000","1400","13600","1000","2000","44"},//44
            {"2900","3000","1200","13400","1000","2000","45"} //45
		};
		std::string *pAimPtr = strParams[nIndex];
		//移除所有的参数
        m_setParams.clear();
        //常留气量(单位:ml)
		m_setParams["RemainVolume"] = pAimPtr[0];
		//最大气量(单位:ml)
		m_setParams["RespVolume"] = pAimPtr[1];
		//吸气时间(单位:0.1ms)
		m_setParams["Inspiration_Time"] = pAimPtr[2];
		//总周期时间(单位:0.1ms)
		m_setParams["RespTime"] = pAimPtr[3];
		//CO2(吸气)
		m_setParams["CO2Time_Inspirate"] = pAimPtr[4];
		//CO2(呼气)
		m_setParams["CO2Time_Exhale"] = pAimPtr[5];
		//呼吸次数
		m_setParams["RespRate"] = pAimPtr[6];

		m_eRefurbishDataRange = RD_LoadConfigFile;
	}

	//返回吸气的时间(单位：0.1ms)
	int  CAdultRespParam::GetInspriationTime()
	{
		return boost::lexical_cast<int>( m_setParams["Inspiration_Time"] );
	}

	//返回呼气的时间(单位：0.1ms)
	int  CAdultRespParam::GetExhaleTime()
	{
		return GetRespCycleTime() - GetInspriationTime();
	}

	//返回周期时间(单位：0.1ms)
	int   CAdultRespParam::GetRespCycleTime()
	{
		return boost::lexical_cast<int>( m_setParams["RespTime"] );
	}

	//返回总气量
	float CAdultRespParam::GetRespVolume()
	{
		return boost::lexical_cast<float>( m_setParams["RespVolume"] );
	}

	//返回呼气后的剩余气量
	float CAdultRespParam::GetRespRemainVolume()
	{
		return boost::lexical_cast<float>( m_setParams["RemainVolume"] );
	}

	//返回吸气时，CO2的下降时间(单位：0.1ms)
	int  CAdultRespParam::GetCO2Time_Inspiration()
	{
		return boost::lexical_cast<int>( m_setParams["CO2Time_Inspirate"] );
	}

	//返回呼气时，CO2的上升时间(单位：0.1ms)
	int  CAdultRespParam::GetCO2Time_Exhale()
	{
		return boost::lexical_cast<int>( m_setParams["CO2Time_Exhale"] );
	}

	//返回呼吸次数
	int  CAdultRespParam::GetRespRate()
	{
		return boost::lexical_cast<int>( m_setParams["RespRate"] );
	}
}}}
